In [86]:
import pandas as pd

In [87]:
titanic = pd.read_csv("titanic.csv" , sep=",")
titanic.head(5)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [ ]:
#Question 1

In [122]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
Survived                   887 non-null int64
Pclass                     887 non-null int64
Name                       887 non-null object
Sex                        887 non-null object
Age                        887 non-null float64
Siblings/Spouses Aboard    887 non-null int64
Parents/Children Aboard    887 non-null int64
Fare                       887 non-null float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.5+ KB

In [ ]:
#Question 2

In [123]:
for col in titanic:
    print(col)

Survived
Pclass
Name
Sex
Age
Siblings/Spouses Aboard
Parents/Children Aboard
Fare

In [89]:
ti_shape = titanic.shape
print("This data has {} rows and {} columns".format(ti_shape[0] , ti_shape[1]))

This data has 887 rows and 8 columns

In [90]:
print("The columns in this dataset are:")
titanic.dtypes

The columns in this dataset are:

Survived                     int64
Pclass                       int64
Name                        object
Sex                         object
Age                        float64
Siblings/Spouses Aboard      int64
Parents/Children Aboard      int64
Fare                       float64
dtype: object

In [ ]:
#Question 3

In [91]:
ti_pivot1 = titanic.pivot_table(index = "Sex" , columns="Pclass")
ti_pivot1

              Age                              Fare                        \
Pclass          1          2          3           1          2          3
Sex
female  35.255319  28.980263  22.135417  106.125798  21.970121  16.118810
male    41.511639  30.493796  26.470612   67.226127  19.741782  12.695466

       Parents/Children Aboard                     Siblings/Spouses Aboard  \
Pclass                       1         2         3                       1
Sex
female                0.457447  0.605263  0.798611                0.553191
male                  0.278689  0.222222  0.227405                0.311475

                            Survived
Pclass         2         3         1         2         3
Sex
female  0.486842  0.895833  0.968085  0.921053  0.500000
male    0.342593  0.504373  0.368852  0.157407  0.137026

In [92]:
ti_pivot1= titanic[["Sex", "Age"]].pivot_table(index="Sex")
ti_pivot1.round()

         Age
Sex
female  28.0
male    30.0

In [93]:
ti_pivot2= titanic[["Sex", "Pclass"]].pivot_table(index="Sex")
ti_pivot2.round(2)

        Pclass
Sex
female    2.16
male      2.39

In [94]:
ti_pivot3= titanic[["Sex","Survived"]].pivot_table(index="Sex")
ti_pivot3.round(2)

        Survived
Sex
female      0.74
male        0.19

In [ ]:
#Question 4

In [95]:
ti_kids = titanic[titanic["Age"] < 13]
ti_teens = titanic[ (titanic["Age"] > 13) & (titanic["Age"] <= 18) ]
ti_adult = titanic[ (titanic["Age"] > 18) & (titanic["Age"] <= 50) ]
ti_old = titanic[titanic["Age"] > 50]

In [96]:
ti_kids.head(3)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
7,0,3,Master. Gosta Leonard Palsson,male,2.0,3,1,21.075
10,1,3,Miss. Marguerite Rut Sandstrom,female,4.0,1,1,16.700
16,0,3,Master. Eugene Rice,male,2.0,4,1,29.125

In [97]:
ti_teens.head(3)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708
14,0,3,Miss. Hulda Amanda Adolfina Vestrom,female,14.0,0,0,7.8542
22,1,3,Miss. Anna McGowan,female,15.0,0,0,8.0292

In [98]:
ti_adult.head(3)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250

In [99]:
ti_old.head(3)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
6,0,1,Mr. Timothy J McCarthy,male,54.0,0,0,51.8625
11,1,1,Miss. Elizabeth Bonnell,female,58.0,0,0,26.5500
15,1,2,Mrs. (Mary D Kingcome) Hewlett,female,55.0,0,0,16.0000

In [ ]:
#Question 4

In [117]:
titanic.where(titanic["Age"] > 18).pivot_table(index="Sex" , aggfunc="count")["Name"]

Sex
female    234
male      487
Name: Name, dtype: int64

In [118]:
titanic.where(titanic["Age"] <= 18).pivot_table(index="Sex" , aggfunc="count")["Name"]

Sex
female    80
male      86
Name: Name, dtype: int64